## Data Cleaning and Pandas

See Chapter 7 of "Python for Data Analysis" by Wes McKinney

In [1]:
import pandas as pd
import numpy as np

### Detecting and dealing with missing data

python uses both null and NaN 

in Pandas,  the convention is to use NaN to indicate missing data

### Comment on dropping Na values

There are times when it seems to okay to simply drop Nas,   if a variable has over 50% of the variables missing,  it may be simply useless

But, in general,  we really want to know why data is missing before we remove it.

If there are patterns or correlations in the missing data, that means something.

Some ML tools can use Na values in the model,  such as GBMLight,   so they attempt to include the Na values as data input

In [2]:
stuff=['cat','dog','hamster',np.nan, 'aardvark']
stuff2=[1,2,None,3,4]

first_df=pd.DataFrame(list(zip(stuff,stuff2)),columns=['animal','flag'])
                                                       
first_df.head()

     animal  flag
0       cat   1.0
1       dog   2.0
2   hamster   NaN
3       NaN   3.0
4  aardvark   4.0

In [3]:
first_df.isnull()

   animal   flag
0   False  False
1   False  False
2   False   True
3    True  False
4   False  False

In [4]:
#Question-  what is happeing here with NaN and null?  How do the detection functions isnull and isna seem to work

In [5]:
first_df.animal.isnull()

0    False
1    False
2    False
3     True
4    False
Name: animal, dtype: bool

In [6]:
first_df.flag.isna()

0    False
1    False
2     True
3    False
4    False
Name: flag, dtype: bool

In [7]:
first_df.animal.notnull()

0     True
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [8]:
# Automatic removal of rows or columns with NA

In [9]:
from numpy import nan as NA

# note the aliasing of nan as NA,   this may be easy to read

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4]=NA
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

# look up pandas dropna,    what other options are there for how=?,    what is axis=1 doing?   What is the default axis?

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA

df

          0         1         2
0  0.386713       NaN       NaN
1  0.262740       NaN       NaN
2  0.480291       NaN  0.880456
3 -2.379565       NaN  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

In [13]:
df.dropna(thresh=2)

          0         1         2
2  0.480291       NaN  0.880456
3 -2.379565       NaN  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

# Filling in missing data

imputing or filling in constants

In [14]:
df.fillna(0)

          0         1         2
0  0.386713  0.000000  0.000000
1  0.262740  0.000000  0.000000
2  0.480291  0.000000  0.880456
3 -2.379565  0.000000  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

In [15]:
df.fillna(data.mean())

          0         1         2
0  0.386713  6.500000  3.000000
1  0.262740  6.500000  3.000000
2  0.480291  6.500000  0.880456
3 -2.379565  6.500000  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

In [16]:
df.fillna({1:0.5,2.0:0})

          0         1         2
0  0.386713  0.500000  0.000000
1  0.262740  0.500000  0.000000
2  0.480291  0.500000  0.880456
3 -2.379565  0.500000  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

In [17]:
df.fillna({1:data[1].mean(),2.0:data[2].mean()})

          0         1         2
0  0.386713  6.500000  3.000000
1  0.262740  6.500000  3.000000
2  0.480291  6.500000  0.880456
3 -2.379565  6.500000  0.107131
4  1.111231 -0.040936  0.618744
5  1.537079 -0.870718  0.767088
6  0.648024  0.460850 -0.032981

# # Question
Explain what the previous two cells are doing
Create a cell below that replaces Na with the median

## dropping duplicate rows

In [18]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [19]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [20]:
np.sum(data.duplicated())

1

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

## Replacing values and Sentinels

In many older systems, there are "sentinel" or "marker" values that indicate missing data,   common values used for this are 9999, 99999, -9999, "?", etc.  

In pf.read_csv(),  and probably many other read() operations, we can specify the values interpretted as Na

na_values:  scalar, str, list-like, or dict, optional

Additional strings to recognize as NA/NaN. If dict passed, specific per-column NA values. By default the following values are interpreted as NaN: ‘’, ‘#N/A’, ‘#N/A N/A’, ‘#NA’, ‘-1.#IND’, ‘-1.#QNAN’, ‘-NaN’, ‘-nan’, ‘1.#IND’, ‘1.#QNAN’, ‘<NA>’, ‘N/A’, ‘NA’, ‘NULL’, ‘NaN’, ‘n/a’, ‘nan’, ‘null’.

In [22]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [23]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [24]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Altering Axis indexes

In [25]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [26]:
#Applying a transformation to indices

def trans(x):
    return( x[0:4].upper() )

data.index=data.index.map(trans)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [27]:
data.index

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [28]:
 # This is a function I've been trying to find for a while, handy
# Notice that extra space in the index 'NEW '    
     
data.rename(index={'NEW ': 'NY'},columns={'three': 'peekaboo'})

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NY      8    9        10    11

In [29]:
data.rename(index={'NEW ': 'NY'})

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NY      8    9     10    11

In [30]:
## Discretization and Binning of continuous data

In [31]:


ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

#convert to categorical ranges

bins = [18, 25, 35, 60, 100]
    
cats = pd.cut(ages, bins)   

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [32]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [33]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [34]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [35]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

# when you create a categorizer,  where are the categories names? Where are the values for each specimen?

In [36]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

# is this set up to indicate an ordered category?

## Dividing data into equally spaced quintiles

qcut produces a desired number of quintile categories

In [37]:
data = np.random.randn(1000)  # Normally distributed

cats = pd.qcut(data, 4)  # Cut into quartiles

cats

[(-3.1319999999999997, -0.608], (0.711, 3.348], (-0.0113, 0.711], (-0.608, -0.0113], (-0.608, -0.0113], ..., (-3.1319999999999997, -0.608], (0.711, 3.348], (-3.1319999999999997, -0.608], (-3.1319999999999997, -0.608], (-0.608, -0.0113]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1319999999999997, -0.608] < (-0.608, -0.0113] < (-0.0113, 0.711] < (0.711, 3.348]]

In [38]:
pd.value_counts(cats)

(-3.1319999999999997, -0.608]    250
(-0.608, -0.0113]                250
(-0.0113, 0.711]                 250
(0.711, 3.348]                   250
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [39]:
data = pd.DataFrame(np.random.randn(1000, 4))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016378     0.023563     0.029596     0.031024
std       0.987769     0.979412     1.010224     1.019160
min      -3.047942    -2.939932    -3.432719    -3.344714
25%      -0.616836    -0.585079    -0.648562    -0.604561
50%       0.017294     0.066410     0.027457     0.025455
75%       0.663953     0.675528     0.694020     0.684347
max       3.448914     2.958529     3.471847     4.302880

In [40]:
# Detecting values with abs value over 3 from column 2

col = data[2]

col[np.abs(col) > 3]

231   -3.432719
317    3.471847
918    3.178657
978    3.295493
Name: 2, dtype: float64

In [41]:
data[(np.abs(data) > 3).any(1)]

TypeError: NDFrame._add_numeric_operations.<locals>.any() takes 1 positional argument but 2 were given